In [2]:
import pandas as pd

Creating Pandas Series

In [3]:
series1 = pd.Series([1, 2, 3, 4, 5])
print(series1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

Creatinf a series using dictionary, rather thengiving default index from 0 it considers key of dict as index

In [6]:
dict1 = {'a': 1, 'b': 2, 'c': 3}
series_dict = pd.Series(dict1)
print(series_dict)

a    1
b    2
c    3
dtype: int64

Using index keyword to give custom index

In [7]:
data = [10, 20, 30]
index = ['a', 'b', 'c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

Creating a dataframe from dictionary of list

In [9]:
dict1 = {
    'Name': ["Vaibhav", "Poonam", "Bhushan", "Minal"],
    'Age': [21, 32, 35, 27],
    'City': ['USA', "Pune", "Denmark", "Florida"]    
}
df = pd.DataFrame(dict1)
print(df)

      Name  Age     City
0  Vaibhav   21      USA
1   Poonam   32     Pune
2  Bhushan   35  Denmark
3    Minal   27  Florida

Converting Dataframe to numpy array

In [10]:
import numpy as np
arr1 = np.array(df)
print(arr1)

[['Vaibhav' 21 'USA']
 ['Poonam' 32 'Pune']
 ['Bhushan' 35 'Denmark']
 ['Minal' 27 'Florida']]

Create a dataframe from list of dictionary

In [12]:
dict1 = [
    {"Name": "Vaibhav", "Age": 21, "City": "USA"},
    {"Name": "Poonam", "Age": 32, "City": "USA"},
    {"Name": "Bhushan", "Age": 32, "City": "USA"}
]

df = pd.DataFrame(dict1)
print(df)

      Name  Age City
0  Vaibhav   21  USA
1   Poonam   32  USA
2  Bhushan   32  USA

Reading a csv file and converting it to dataframe

In [14]:
df = pd.read_csv('sales_data.csv')
df.head(5)  #head is used to get number of records here we are using 5 to get 5 records
df.tail(5)  #tail is used to get last records

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

Accessing Data from DataFrame, loc(), iloc()

In [24]:
dict1 = [
    {"Name": "Vaibhav", "Age": 21, "City": "USA"},
    {"Name": "Poonam", "Age": 32, "City": "USA"},
    {"Name": "Bhushan", "Age": 32, "City": "USA"}
]

df = pd.DataFrame(dict1)
print(df['Name'])       #note if you are using single column for printing it is a Series
print()
print(df.loc[0])        # means we are going to pick index 0 row, simply loc is row index
print()
print(df.iloc[1])       # means we are going to pick index 1 from columns, simply iloc is coulumn index
print()
print(df.loc[0][0])     # accessing single element from dataset

0    Vaibhav
1     Poonam
2    Bhushan
Name: Name, dtype: object

Name    Vaibhav
Age          21
City        USA
Name: 0, dtype: object

Name    Poonam
Age         32
City       USA
Name: 1, dtype: object

Vaibhav

C:\Users\patil\AppData\Local\Temp\ipykernel_14348\609651973.py:14: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc[0][0])

Accessing Specific Elements : at[], iat[]

In [29]:
dict1 = [
    {"Name": "Vaibhav", "Age": 21, "City": "USA"},
    {"Name": "Poonam", "Age": 32, "City": "USA"},
    {"Name": "Bhushan", "Age": 32, "City": "USA"}
]

df = pd.DataFrame(dict1)
print(df)
print()
print(df.at[1, "Age"]) #at is used to get a particular column value at row index, you give row index and column name
print(df.at[2, "Name"])
print()
print(df.iat[1, 1])     # in iat[] you give row and column both index and in iat

      Name  Age City
0  Vaibhav   21  USA
1   Poonam   32  USA
2  Bhushan   32  USA

32
Bhushan

32

# Data Manipulation with DataFrames

In [30]:
dict1 = [
    {"Name": "Vaibhav", "Age": 21, "City": "USA"},
    {"Name": "Poonam", "Age": 32, "City": "USA"},
    {"Name": "Bhushan", "Age": 32, "City": "USA"}
]

df = pd.DataFrame(dict1)
print(df)

      Name  Age City
0  Vaibhav   21  USA
1   Poonam   32  USA
2  Bhushan   32  USA

adding new column

In [41]:
df["Salary"] = [500000, 600000, 700000]
print(df)

      Name  Age City  Salary
0  Vaibhav   21  USA  500000
1   Poonam   32  USA  600000
2  Bhushan   32  USA  700000

Removing a column using .drop(), inplace, axis

In [42]:
print(df.drop("Salary", axis=1)) # remember by default it checks for row so you need to give axis to check for columns
print()
print(df)   #you can see the drop operation is not peremenant it will again make the table same on next print
print()
print(df.drop("Salary", axis=1, inplace=True))  # use inplace=True to make changes permenantly
print(df)
print()
df["Age"] = df["Age"] + 1
print(df)
# axis = 0 means row
# axis = 1 means column

      Name  Age City
0  Vaibhav   21  USA
1   Poonam   32  USA
2  Bhushan   32  USA

      Name  Age City  Salary
0  Vaibhav   21  USA  500000
1   Poonam   32  USA  600000
2  Bhushan   32  USA  700000

None
      Name  Age City
0  Vaibhav   21  USA
1   Poonam   32  USA
2  Bhushan   32  USA

      Name  Age City
0  Vaibhav   22  USA
1   Poonam   33  USA
2  Bhushan   33  USA

### some other operation, .describe(), .dtypes

In [43]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [50]:
print("Data Types:\n", df.dtypes)   # prints data type of every column
print()
print("Statistical Summary:\n", df.describe()) # gives basic think of dataset such as mean, count,std, min etc

Data Types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

Statistical Summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000